{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "28e0119a-c33c-4018-ab8a-676dedd97b9b",
   "metadata": {},
   "source": [
    "## CI Components LinkML to GraphML Converter\n",
    "Hard coded converter to move the CI Components Catalog to GraphML. Nodes and relationships are created and can be read in by Neo4j.  \n",
    "\n",
    "### Next Steps and Alternatives\n",
    " - This code does no validation, it expects the users to first validate with linkml and then run this\n",
    " - This code could be generalizable, but it will be a chore. User would have to read linkml schema, get relationships, creates nodes as usual, and then with dynamic relationship information, create relationships.\n",
    "     - I would say if generalization is the goal, creating Pydantic models based off the linkml schema, validating, and creating nodes/relationships is probably the way to go. No entity or component can actually be named, it's all dynamic so that throws in some curveballs.\n",
    " - Building off of others, there is this code that can use the schema and data to output to an RDF/OWL formated TURTLE file. It requires annotations however, and I'm not quite sure how it works, I couldn't get it to work so I'm not sure if the annotations are optional or not even.\n",
    "     - Neo4j can ingest OWL/RDF files, not sure how formatting will work though.\n",
    "     - https://linkml.io/linkml-owl/usage/\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "e8646834-2a8f-4eef-b652-876a8394f2d8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Data url and linkml schema url\n",
    "#data_url = \"https://raw.githubusercontent.com/ICICLE-ai/CI-Components-Catalog/master/architecture/common_arch_v1.yml\"\n",
    "#data_url = \"https://raw.githubusercontent.com/ICICLE-ai/CI-Components-Catalog/master/components-data.yaml\"\n",
    "data_url = \"architecture/common_arch_v1.yml\" # local file instead\n",
    "schema_url = \"https://raw.githubusercontent.com/ICICLE-ai/CI-Components-Catalog/master/ci-component.yaml\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "f8fe9ec0-9d5d-4b3c-97aa-b9084f52928c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded URL.\n",
      "\n",
      "\n",
      "\n",
      "node#1: {'id': 'dataset_labeling_dash', 'name': 'Interactive Dataset Labeling Dashboard (DA)', 'owner': 'Joe Stubbs', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#2: {'id': 'VAReusableGUI', 'name': 'Visual Analytics Reusable GUI', 'owner': 'Joe Stubbs', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#3: {'id': 'ui', 'name': 'ICICLE User Interface', 'owner': 'Joe Stubbs', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#3 <- node#1) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#3 <- node#2) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#3 <- node#4) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#3 <- node#6) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#3 <- node#5) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#3 -> node#9) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "relation: (node#3 -> node#12) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "\n",
      "\n",
      "node#4: {'id': 'ct_dash', 'name': 'Camera Traps Model Evaluation and Capacity Planning Dashboard (AE)', 'owner': 'Joe Stubbs', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#4 -> node#12) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "\n",
      "\n",
      "node#5: {'id': 'data_dash', 'name': 'Dataset Management Dashboard (DA)', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#5 -> node#12) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "\n",
      "\n",
      "node#6: {'id': 'model_dash', 'name': 'Model Training Dashboard (DA)', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#6 -> node#12) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "\n",
      "\n",
      "node#7: {'id': 'authn', 'name': 'ICICLE Tapis OAuth2-based Authentication Service', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#8: {'id': 'authz', 'name': 'ICICLE Tapis Security & Authorization Service', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#9: {'id': 'authn_z', 'name': 'Authentication and Authorization Middleware', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#9 <- node#7) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#9 <- node#8) attrs: {'label': 'contains'}\n",
      "\n",
      "\n",
      "\n",
      "node#10: {'id': 'mc_model_repo', 'name': 'Model Commons Model Repository', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#11: {'id': 'mc_data_repo', 'name': 'Model Commons Data Repository', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#12: {'id': 'mc', 'name': 'Model Commons', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#12 <- node#10) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#12 <- node#11) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#12 -> node#9) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "\n",
      "\n",
      "node#13: {'id': 'adaptive_ai', 'name': 'Adaptive AI Server', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#14: {'id': 'harp', 'name': 'HARP Application Resource Predictor', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#15: {'id': 'tapis_jobs', 'name': 'Tapis Jobs API', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#16: {'id': 'tapis_apps', 'name': 'Tapis Apps API', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#17: {'id': 'tapis_systems', 'name': 'Tapis Systems API', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#18: {'id': 'int_plane', 'name': 'Intelligence Plane', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#18 -> node#12) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "relation: (node#18 -> node#9) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "relation: (node#18 <- node#13) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#18 <- node#14) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#18 -> node#19) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "\n",
      "\n",
      "node#19: {'id': 'Tapis_HPC_middelware', 'name': 'Tapis HPC Middelware', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#19 -> node#9) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "relation: (node#19 <- node#15) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#19 <- node#16) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#19 <- node#17) attrs: {'label': 'contains'}\n",
      "\n",
      "\n",
      "\n",
      "node#20: {'id': 'ml_host_middleware', 'name': 'ICICLE ML Hosting Middleware', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#20 -> node#9) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "relation: (node#20 <- node#21) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#20 <- node#23) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#20 <- node#22) attrs: {'label': 'contains'}\n",
      "\n",
      "\n",
      "\n",
      "node#21: {'id': 'tapis_pods', 'name': 'Tapis Pods API', 'description': 'Hosted Knowledge Graphs, Inference Servers, and related containers', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#22: {'id': 'illuvar', 'name': 'Illuvar functions-as-a-service (FaaS) (RIISS)', 'description': 'Hosted Knowledge Graphs, Inference Servers, and related containers', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#23: {'id': 'tapis_workflows', 'name': 'Tapis Workflows API', 'description': 'Supports the IKLE ETL and caching service', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#24: {'id': 'ml_edge_to_center_middleware', 'name': 'ICICLE ML Edge-to-Center Middleware', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#24 -> node#9) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "relation: (node#24 <- node#25) attrs: {'label': 'contains'}\n",
      "\n",
      "\n",
      "\n",
      "node#25: {'id': 'mon_plane', 'name': 'Monitoring Plane', 'labels': ':Component'}\n",
      "\n",
      "relation: (node#25 -> node#9) attrs: {'label': 'DependsOn'}\n",
      "\n",
      "relation: (node#25 <- node#26) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#25 <- node#27) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#25 <- node#28) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#25 <- node#29) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#25 <- node#30) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#25 <- node#31) attrs: {'label': 'contains'}\n",
      "\n",
      "relation: (node#25 <- node#32) attrs: {'label': 'contains'}\n",
      "\n",
      "\n",
      "\n",
      "node#26: {'id': 'ckn_kb', 'name': 'CKN Knowledge Base (datacenter)', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#27: {'id': 'ckn_cep', 'name': 'CKN CEP Engine (datacenter)', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#28: {'id': 'ckn_cap', 'name': 'CKN Capture Daemon (edge)', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#29: {'id': 'ckn_actuator', 'name': 'CKN Actuator (edge)', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#30: {'id': 'red_edge', 'name': 'RED Edge Placement Planner', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#31: {'id': 'edge_hardware_prov', 'name': 'Dynamic Edge Hardware Provisioning Service (AE)', 'labels': ':Component'}\n",
      "\n",
      "\n",
      "\n",
      "node#32: {'id': 'edge_app_deploy', 'name': 'Edge Application Deployment Service (AE)', 'labels': ':Component'}\n"
     ]
    }
   ],
   "source": [
    "# We parse through the linkml data and create networkx nodes and edges to create a working networkx model.\n",
    "# Once we have that model we can export to graphml. Neo4j is able to read graphml using the apoc plugin.\n",
    "import networkx as nx\n",
    "import yaml\n",
    "import requests\n",
    "\n",
    "\n",
    "# Taken from Yamei's code, grabs from github or uses file based on github attr.\n",
    "def loadYAML(url):\n",
    "    if \"raw.githubusercontent\" in url:\n",
    "        r = requests.get(url)\n",
    "        data_linkml = yaml.safe_load(r.content)\n",
    "        print(\"Loaded URL.\")\n",
    "    else:\n",
    "        with open(url, \"r\") as stream:\n",
    "            data_linkml = yaml.safe_load(stream)\n",
    "    return data_linkml \n",
    "\n",
    "schema = loadYAML(schema_url)\n",
    "data = loadYAML(data_url)\n",
    "\n",
    "G = nx.Graph()\n",
    "\n",
    "# Node ids have to be referenced to make relationships and to create nodes. So we keep reference of node_id here.\n",
    "# When we want to define a relationship between two nodes, we use node_id and second_node_id, doing a quick search\n",
    "# through all classes to find a matching field.\n",
    "# In this case, we hardcode 'components', 'hasDependentComponents', 'related_to', 'relationship_type', and 'id'.\n",
    "node_id = 1\n",
    "for component in data['components']:\n",
    "    # We add in node_id so that I can search for nodes later and refer to node_id. node_id is not added to the nodes, only used by me in this script.\n",
    "    component['node_id'] = node_id\n",
    "    node_id += 1\n",
    "\n",
    "node_id = 1\n",
    "for component in data['components']:\n",
    "    # We add in node_id so that I can search for nodes later and refer to node_id. node_id is not added to the nodes, only used by me in this script.\n",
    "    #component['node_id'] = node_id\n",
    "    component_vars = component.copy()\n",
    "    del component_vars['node_id'] # This allows us to use readLabels later to define node type via this attr.\n",
    "    component_vars['labels'] = \":Component\"\n",
    "    #del component_vars['id']\n",
    "    relationships = component_vars.pop(\"hasDependentComponents\", [])\n",
    "    \n",
    "    ## Create node with all vars we have minus `node_id` and relationships, in this case `hasDependentComponents`.\n",
    "    for key, value in component_vars.items():\n",
    "        if value == None:\n",
    "            component_vars[key] = \"\"\n",
    "    G.add_node(node_id, **component_vars)\n",
    "    print(f\"\\n\\n\\nnode#{node_id}: {component_vars}\")\n",
    "    \n",
    "    ## Get relationship second_node_id\n",
    "    for relationship in relationships:\n",
    "        related_to = relationship['related_to']\n",
    "        relationship_type = relationship['relationship_type']\n",
    "\n",
    "        # Find node_id of component so we can link node \"A\" and second_node_id.\n",
    "        second_node_id = None\n",
    "        for item in data['components']:\n",
    "            if item.get('node_id', None):\n",
    "                if related_to == item['id']:\n",
    "                    second_node_id = item['node_id']\n",
    "                    break\n",
    "        if not second_node_id:\n",
    "            raise KeyError(f\"Could not find item containing id referenced by relationship. Breaking. related_to: {related_to}, node: {node_id}\")\n",
    "        \n",
    "        ## Create edge between node_id and second_node_id\n",
    "        # This is a small example, but type could determine directionality\n",
    "        if relationship_type == 'DependsOn':\n",
    "            relationship_attrs = {'label': relationship_type} # This allows us to use readLabels later to define relationship type via this attr.\n",
    "            G.add_edge(node_id, second_node_id, **relationship_attrs)\n",
    "            print(f\"\\nrelation: (node#{node_id} -> node#{second_node_id}) attrs: {relationship_attrs}\")\n",
    "        if relationship_type == 'contains':\n",
    "            relationship_attrs = {'label': relationship_type} # This allows us to use readLabels later to define relationship type via this attr.\n",
    "            G.add_edge(second_node_id, node_id, **relationship_attrs)\n",
    "            print(f\"\\nrelation: (node#{node_id} <- node#{second_node_id}) attrs: {relationship_attrs}\")\n",
    "\n",
    "    node_id += 1\n",
    "    \n",
    "# We dump to graphml\n",
    "nx.write_graphml(G, \"temp.graphml\", named_key_ids=True) # named_key_ids names keys instead of using references, this allows us to use graphml.import readLabels later to set relationship/node types.\n",
    "# After that, copy and paste to github, we'll use the raw github url for neo4j ingest"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "5bf6c91a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "38b24deb-7525-4b44-a495-283bc54da277",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize Neo4j driver\n",
    "url = \"bolt+s://username.pods.icicle.tapis.io:443\"\n",
    "user = \"username\"\n",
    "passw = \"password\"\n",
    "from neo4j import GraphDatabase\n",
    "neo = GraphDatabase.driver(url,\n",
    "                           auth = (user, passw),\n",
    "                           max_connection_lifetime=30)\n",
    "\n",
    "# Delete all current\n",
    "# from py2neo import Graph\n",
    "# #graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"newPassword\"))\n",
    "# graph = Graph(url, auth=(user, passw), name='neo4j')\n",
    "# c1 = \"match (a) -[r] -> () delete a, r\"\n",
    "# c2 = \"match (a) delete a\"\n",
    "# graph.run(c1)\n",
    "# graph.run(c2)\n",
    "# Read current node/edge counts\n",
    "# result = graph.run(\"MATCH (n) RETURN count(n) as num\")\n",
    "# for record in result:\n",
    "#     print(f\"Number of nodes in the database: {record['num']}\")\n",
    "# result = graph.run(\"MATCH (n)-[r]->() RETURN COUNT(r) as num\")\n",
    "# for record in result:\n",
    "#     print(f\"Number of edges in the database: {record['num']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "43e42c04-7772-4d92-a2a4-52189cd9d957",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.work.result.Result object at 0x7f9c55e24700>\n"
     ]
    }
   ],
   "source": [
    "# Use apoc plugin to import graphml from a github url (That you should specify after saving the `nx.write_graphml()` result from earlier remotely).\n",
    "with neo.session() as session:\n",
    "    result = session.run('CALL apoc.import.graphml(\"https://raw.githubusercontent.com/NotChristianGarcia/CI-Components-Catalog/master/file.graphml\", {readLabels: true})')\n",
    "    print(result)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
